final_project/app/controllers/block_relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    user = User.find(params[:blocked_id])

SELECT  "block_relationships".* FROM "block_relationships" WHERE "block_relationships"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    user = BlockRelationship.find(params[:id]).blocked