final_project/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."gender" = ?  [["gender", "female"]]
SELECT "users".* FROM "users"
---
  def index
    if current_user.sexual_preference == "male" && current_user.gender == "male"
        @user = User.where(gender: "male").where(sexual_preference: "male")
    elsif  current_user.sexual_preference == "female" && current_user.gender == "female"
            @user = User.where(gender: "female").where(sexual_preference: "female")
   else
      @user = User.where(gender: current_user.sexual_preference)
  end

  if params[:search].present?
    if params[:search][:age_from].present? && params[:search][:age_to].present?
      @user = @user.where("age > ? and age < ?",params[:search][:age_from].to_i,params[:search][:age_to].to_i)
    elsif params[:search][:children].present? && params[:search][:children] == "yes"
      @user = @user.where.not(children: "")

INSERT INTO "users" ("full_name", "email", "age", "gender", "children", "sexual_preference", "created_at", "updated_at", "password_digest", "occupation", "ethnicity") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def edit
     @user = User.find(params[:id])  # Could technically delete this line because of the correct_user user method and filter? (line 5)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "full_name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["full_name", "Andrew Keith"], ["password_digest", "$2a$10$tYdb/JIQSGKkJbHY6KG0XegCR07rkC0pD2kvVLXzUDQL7npOIEa/C"], ["updated_at", "2017-08-30 17:12:20.918759"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])  # Could technically delete this line because of the correct_user user method and filter? (line 5)
    if @user.update_attributes(user_params)