final_project/app/controllers/winks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 102], ["LIMIT", 1]]
---
  def create
    user = User.find(params[:wink_recipient_id])