final_project/app/views/users/_filter_searches.html.erb

SELECT DISTINCT "users"."ethnicity" FROM "users"
---
<%= f.label :ethnicity %>
<%= f.select :ethnicity, User.distinct(:ethnicity).pluck(:ethnicity)%>